pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr50431.h
/* HSPLLCTL Control Bits */
#define PLLM                             (0xfc00)        /* PLL Multiplier */
#define PLLM_H                           (0x00fc)
#define PLLM0                            (0x0400)        /* PLL Multiplier */
#define PLLM0_H                          (0x0004)
#define PLLM1                            (0x0800)        /* PLL Multiplier */
#define PLLM1_H                          (0x0008)
#define PLLM2                            (0x1000)        /* PLL Multiplier */
#define PLLM2_H                          (0x0010)
#define PLLM3                            (0x2000)        /* PLL Multiplier */
#define PLLM3_H                          (0x0020)
#define PLLM4                            (0x4000)        /* PLL Multiplier */
#define PLLM4_H                          (0x0040)
#define PLLM5                            (0x8000)        /* PLL Multiplier */
#define PLLM5_H                          (0x0080)
#define PLLM_16                          (0x4000)        /* */
#define PLLM_16_H                        (0x0040)
#define PLLM_17                          (0x4400)        /* */
#define PLLM_17_H                        (0x0044)
#define PLLM_18                          (0x4800)        /* */
#define PLLM_18_H                        (0x0048)
#define PLLM_19                          (0x4c00)        /* */
#define PLLM_19_H                        (0x004c)
#define PLLM_20                          (0x5000)        /* */
#define PLLM_20_H                        (0x0050)
#define PLLM_21                          (0x5400)        /* */
#define PLLM_21_H                        (0x0054)
#define PLLM_22                          (0x5800)        /* */
#define PLLM_22_H                        (0x0058)
#define PLLM_23                          (0x5c00)        /* */
#define PLLM_23_H                        (0x005c)
#define PLLM_24                          (0x6000)        /* */
#define PLLM_24_H                        (0x0060)
#define PLLM_25                          (0x6400)        /* */
#define PLLM_25_H                        (0x0064)
#define PLLM_26                          (0x6800)        /* */
#define PLLM_26_H                        (0x0068)
#define PLLM_27                          (0x6c00)        /* */
#define PLLM_27_H                        (0x006c)
#define PLLM_28                          (0x7000)        /* */
#define PLLM_28_H                        (0x0070)
#define PLLM_29                          (0x7400)        /* */
#define PLLM_29_H                        (0x0074)
#define PLLM_30                          (0x7800)        /* */
#define PLLM_30_H                        (0x0078)
#define PLLM_31                          (0x7c00)        /* */
#define PLLM_31_H                        (0x007c)
#define PLLM_32                          (0x8000)        /* */
#define PLLM_32_H                        (0x0080)
#define PLLM_33                          (0x8400)        /* */
#define PLLM_33_H                        (0x0084)
#define PLLM_34                          (0x8800)        /* */
#define PLLM_34_H                        (0x0088)
#define PLLM_35                          (0x8c00)        /* */
#define PLLM_35_H                        (0x008c)
#define PLLM_36                          (0x9000)        /* */
#define PLLM_36_H                        (0x0090)
#define PLLM_37                          (0x9400)        /* */
#define PLLM_37_H                        (0x0094)
#define PLLM_38                          (0x9800)        /* */
#define PLLM_38_H                        (0x0098)
#define PLLM_39                          (0x9c00)        /* */
#define PLLM_39_H                        (0x009c)
#define PLL_LOCK                         (0x0001)        /* PLL Lock Status */
#define PLL_LOCK_L                       (0x0001)
#define PLL_LOCK_0                       (0x0000)        /* PLL is not running or not locked */
#define PLL_LOCK_1                       (0x0001)        /* PLL is locked */
#define PLL_LOCK_1_L                     (0x0001)
#define PLLINFREQ                        (0x0100)        /* PLL Input Frequency Selection. */
#define PLLINFREQ_H                      (0x0001)
#define PLLINFREQ_0                      (0x0000)        /* Input frequency is equal to 6MHz or lower than 6MHz */
#define PLLINFREQ_1                      (0x0100)        /* Input frequency is higher than 6MHz */
#define PLLINFREQ_1_H                    (0x0001)

/* HSPLLUSSXTLCTL Control Bits */
#define USSXTEN                          (0x0001)        /* USSXT Enable. */
#define USSXTEN_L                        (0x0001)
#define USSXTEN_0                        (0x0000)        /* Disable USSXT Oscillator */
#define USSXTEN_1                        (0x0001)        /* Enable USSXT Oscillator */
#define USSXTEN_1_L                      (0x0001)
#define XTOUTOFF                         (0x0100)        /* USSXT Buffered Output OFF */
#define XTOUTOFF_H                       (0x0001)
#define XTOUTOFF_0                       (0x0000)        /* Enable USSXT buffered output */
#define XTOUTOFF_1                       (0x0100)        /* Disable USSXT buffered output. Default. */
#define XTOUTOFF_1_H                     (0x0001)
#define OSCTYPE                          (0x0200)        /* Reserved */
#define OSCTYPE_H                        (0x0002)
#define OSCTYPE_0                        (0x0000)        /* Gating Counter Length: 4096. It is recommended to use this 
                                                            configuration for crystal resonators.  Note: the counter 
                                                            counts the oscillator clock, so total time can be calculated 
                                                            as Time = 4096 x 1/Oscillator Clock Frequency. */
#define OSCTYPE_1                        (0x0200)        /* Gating Counter Length: 512. It is recommended to use this 
                                                            configuration for ceramic resonators. Note: the counter counts
                                                            the oscillator clock, so total time can be calculated as Time 
                                                            = 512x 1/Oscillator Clock Frequency. */
#define OSCTYPE_1_H                      (0x0002)
#define OSCTYPE__XTAL                    (0x0000)        /* Gating Counter Length: 4096. It is recommended to use this 
                                                            configuration for crystal resonators.  Note: the counter 
                                                            counts the oscillator clock, so total time can be calculated 
                                                            as Time = 4096 x 1/Oscillator Clock Frequency. */
#define OSCTYPE__CERAMIC                 (0x0200)        /* Gating Counter Length: 512. It is recommended to use this 
                                                            configuration for ceramic resonators. Note: the counter counts
                                                            the oscillator clock, so total time can be calculated as Time 
                                                            = 512x 1/Oscillator Clock Frequency. */
#define OSCTYPE__CERAMIC_H               (0x0002)
#define OSCSTATE                         (0x0002)        /* Oscillator Status Bit. */
#define OSCSTATE_L                       (0x0002)
#define OSCSTATE_0                       (0x0000)        /* Oscillator is either not enabled or in the middle of start-up 
                                                            transition. */
#define OSCSTATE_1                       (0x0002)        /* Oscillator has started but is not stable yet. Wait for 
                                                            sufficient time for stabilization. */
#define OSCSTATE_1_L                     (0x0002)


/*****************************************************************************
 LEA Registers
*****************************************************************************/

#define __MSP430_HAS_LEA__                    /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_LEA__ 0x0A80
#define LEA_BASE               __MSP430_BASEADDRESS_LEA__

sfr_l(LEACAP);                                /* LEA Capability Register */
sfr_w(LEACAPL);
sfr_w(LEACAPH);
sfr_l(LEACNF0);                               /* Configuration Register 0 */
sfr_w(LEACNF0L);
sfr_w(LEACNF0H);
sfr_l(LEACNF1);                               /* Configuration Register 1 */
sfr_w(LEACNF1L);
sfr_w(LEACNF1H);
sfr_l(LEACNF2);                               /* Configuration Register 2 */
sfr_w(LEACNF2L);
sfr_w(LEACNF2H);
sfr_l(LEAMB);                                 /* Memory Bottom Register */
sfr_w(LEAMBL);
sfr_w(LEAMBH);
sfr_l(LEAMT);                                 /* Memory Top Register */
sfr_w(LEAMTL);
sfr_w(LEAMTH);
sfr_l(LEACMA);                                /* Code Memory Access Register */
sfr_w(LEACMAL);
sfr_w(LEACMAH);
sfr_l(LEACMCTL);                              /* Code Memory Control Register */
sfr_w(LEACMCTLL);
sfr_w(LEACMCTLH);
sfr_l(LEACMDSTAT);                            /* LEA Command Status Register */
sfr_w(LEACMDSTATL);
sfr_w(LEACMDSTATH);
sfr_l(LEAS1STAT);                             /* LEA Source 1 Status Register */
sfr_w(LEAS1STATL);
sfr_w(LEAS1STATH);
sfr_l(LEAS0STAT);                             /* LEA Source 0 Status Register */
sfr_w(LEAS0STATL);
sfr_w(LEAS0STATH);
sfr_l(LEADSTSTAT);                            /* LEA Result Status Register */
sfr_w(LEADSTSTATL);
sfr_w(LEADSTSTATH);
sfr_l(LEAPMCTL);                              /* PM Control Register */
sfr_w(LEAPMCTLL);
sfr_w(LEAPMCTLH);
sfr_l(LEAPMDST);                              /* PM Result Register */
sfr_w(LEAPMDSTL);
sfr_w(LEAPMDSTH);
sfr_l(LEAPMS1);                               /* PM Source 1 Register */
sfr_w(LEAPMS1L);
sfr_w(LEAPMS1H);
sfr_l(LEAPMS0);                               /* PM Source 0 Register */
sfr_w(LEAPMS0L);
sfr_w(LEAPMS0H);
sfr_l(LEAPMCB);                               /* PM Command Buffer Register */
sfr_w(LEAPMCBL);
sfr_w(LEAPMCBH);
sfr_l(LEAIFGSET);                             /* Interrupt Flag and Set Register */
sfr_w(LEAIFGSETL);
sfr_w(LEAIFGSETH);
sfr_l(LEAIE);                                 /* Interrupt Enable Register */
sfr_w(LEAIEL);
sfr_w(LEAIEH);
sfr_l(LEAIFG);                                /* Interrupt Flag and Clear Register */
sfr_w(LEAIFGL);
sfr_w(LEAIFGH);
sfr_l(LEAIV);                                 /* Interrupt Vector Register */
sfr_w(LEAIVL);
sfr_w(LEAIVH);

/* LEA Register Offsets */
#define OFS_LEACAP                       (0x0000)
#define OFS_LEACAP_L                     OFS_LEACAP
#define OFS_LEACAP_H                     OFS_LEACAP+2
#define OFS_LEACNF0                      (0x0004)
#define OFS_LEACNF0_L                    OFS_LEACNF0
#define OFS_LEACNF0_H                    OFS_LEACNF0+2
#define OFS_LEACNF1                      (0x0008)
#define OFS_LEACNF1_L                    OFS_LEACNF1
#define OFS_LEACNF1_H                    OFS_LEACNF1+2
#define OFS_LEACNF2                      (0x000C)
#define OFS_LEACNF2_L                    OFS_LEACNF2
#define OFS_LEACNF2_H                    OFS_LEACNF2+2
#define OFS_LEAMB                        (0x0010)
#define OFS_LEAMB_L                      OFS_LEAMB
#define OFS_LEAMB_H                      OFS_LEAMB+2
#define OFS_LEAMT                        (0x0014)
#define OFS_LEAMT_L                      OFS_LEAMT
#define OFS_LEAMT_H                      OFS_LEAMT+2
#define OFS_LEACMA                       (0x0018)
#define OFS_LEACMA_L                     OFS_LEACMA
#define OFS_LEACMA_H                     OFS_LEACMA+2
#define OFS_LEACMCTL                     (0x001C)
#define OFS_LEACMCTL_L                   OFS_LEACMCTL
#define OFS_LEACMCTL_H                   OFS_LEACMCTL+2
#define OFS_LEACMDSTAT                   (0x0028)
#define OFS_LEACMDSTAT_L                 OFS_LEACMDSTAT
#define OFS_LEACMDSTAT_H                 OFS_LEACMDSTAT+2
#define OFS_LEAS1STAT                    (0x002C)
#define OFS_LEAS1STAT_L                  OFS_LEAS1STAT
#define OFS_LEAS1STAT_H                  OFS_LEAS1STAT+2
#define OFS_LEAS0STAT                    (0x0030)
#define OFS_LEAS0STAT_L                  OFS_LEAS0STAT
#define OFS_LEAS0STAT_H                  OFS_LEAS0STAT+2
#define OFS_LEADSTSTAT                   (0x0034)
#define OFS_LEADSTSTAT_L                 OFS_LEADSTSTAT
#define OFS_LEADSTSTAT_H                 OFS_LEADSTSTAT+2
#define OFS_LEAPMCTL                     (0x0040)
#define OFS_LEAPMCTL_L                   OFS_LEAPMCTL
#define OFS_LEAPMCTL_H                   OFS_LEAPMCTL+2
#define OFS_LEAPMDST                     (0x0044)
#define OFS_LEAPMDST_L                   OFS_LEAPMDST
#define OFS_LEAPMDST_H                   OFS_LEAPMDST+2
#define OFS_LEAPMS1                      (0x0048)
#define OFS_LEAPMS1_L                    OFS_LEAPMS1
#define OFS_LEAPMS1_H                    OFS_LEAPMS1+2
#define OFS_LEAPMS0                      (0x004C)
#define OFS_LEAPMS0_L                    OFS_LEAPMS0
#define OFS_LEAPMS0_H                    OFS_LEAPMS0+2
#define OFS_LEAPMCB                      (0x0050)
#define OFS_LEAPMCB_L                    OFS_LEAPMCB
#define OFS_LEAPMCB_H                    OFS_LEAPMCB+2
#define OFS_LEAIFGSET                    (0x0070)
#define OFS_LEAIFGSET_L                  OFS_LEAIFGSET
#define OFS_LEAIFGSET_H                  OFS_LEAIFGSET+2
#define OFS_LEAIE                        (0x0074)
#define OFS_LEAIE_L                      OFS_LEAIE
#define OFS_LEAIE_H                      OFS_LEAIE+2
#define OFS_LEAIFG                       (0x0078)
#define OFS_LEAIFG_L                     OFS_LEAIFG
#define OFS_LEAIFG_H                     OFS_LEAIFG+2
#define OFS_LEAIV                        (0x007C)
#define OFS_LEAIV_L                      OFS_LEAIV
#define OFS_LEAIV_H                      OFS_LEAIV+2

