pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr50431.h
/* SDHSCTL0 Control Bits */
#define DALGN                            (0x0080)        /* Data alignment */
#define DALGN_L                          (0x0080)
#define DALGN_0                          (0x0000)        /* Right-aligned. */
#define DALGN_1                          (0x0080)        /* Left-aligned. */
#define DALGN_1_L                        (0x0080)
#define DFMSEL                           (0x0300)        /* Data format */
#define DFMSEL_H                         (0x0003)
#define DFMSEL0                          (0x0100)        /* Data format */
#define DFMSEL0_H                        (0x0001)
#define DFMSEL1                          (0x0200)        /* Data format */
#define DFMSEL1_H                        (0x0002)
#define DFMSEL_0                         (0x0000)        /* 2's complement */
#define DFMSEL_1                         (0x0100)        /* Offset binary */
#define DFMSEL_1_H                       (0x0001)
#define DFMSEL_2                         (0x0200)        /* Reserved (defaults to 0, 2s complement) */
#define DFMSEL_2_H                       (0x0002)
#define DFMSEL_3                         (0x0300)        /* Reserved (defaults to 0, 2s complement) */
#define DFMSEL_3_H                       (0x0003)
#define INTDLY                           (0x000e)        /* */
#define INTDLY_L                         (0x000e)
#define INTDLY0                          (0x0002)        /* */
#define INTDLY0_L                        (0x0002)
#define INTDLY1                          (0x0004)        /* */
#define INTDLY1_L                        (0x0004)
#define INTDLY2                          (0x0008)        /* */
#define INTDLY2_L                        (0x0008)
#define INTDLY_0                         (0x0000)        /* No dealy */
#define INTDLY_1                         (0x0002)        /* 1 sample delay, 2nd sample is the first interrupt */
#define INTDLY_1_L                       (0x0002)
#define INTDLY_2                         (0x0004)        /* 2 samples delay, 3rd sample is the first interrupt */
#define INTDLY_2_L                       (0x0004)
#define INTDLY_3                         (0x0006)        /* 3 samples delay, 4rd sample is the first interrupt */
#define INTDLY_3_L                       (0x0006)
#define INTDLY_4                         (0x0008)        /* 4 samples delay, 5th sample is the first interrupt */
#define INTDLY_4_L                       (0x0008)
#define INTDLY_5                         (0x000a)        /* 5 samples delay, 6th sample is the first interrupt */
#define INTDLY_5_L                       (0x000a)
#define INTDLY_6                         (0x000c)        /* 6 samples delay, 7th sample is the first interrupt */
#define INTDLY_6_L                       (0x000c)
#define INTDLY_7                         (0x000e)        /* 7 samples delay, 8th sample is the first interrupt */
#define INTDLY_7_L                       (0x000e)
#define AUTOSSDIS                        (0x0001)        /* SDHS Auto Sample Start Disable */
#define AUTOSSDIS_L                      (0x0001)
#define AUTOSSDIS_0                      (0x0000)        /* Auto Sample start enabled. SDHS is powered up when the 
                                                            SHDS_PWR_UP applied, then data conversion is automatically 
                                                            started once the SDHS is fully powered up. */
#define AUTOSSDIS_1                      (0x0001)        /* Auto Sample start disabled.  (This configuration must be used 
                                                            when the ASQ controls the measurement sequences) - SHDS_PWR_UP
                                                            signal to turns on the SDHS - CONVERSION_START signal to start
                                                            data convesion */
#define AUTOSSDIS_1_L                    (0x0001)
#define TRGSRC                           (0x8000)        /* SDHS trigger source select. */
#define TRGSRC_H                         (0x0080)
#define TRGSRC_0                         (0x0000)        /* Register control mode:  - CTL4.SDHSON is the source of the 
                                                            SHDS_PWR_UP/DOWN signal - CTL5.SSTART is the source of the 
                                                            CONVERSION_START/STOP signal */
#define TRGSRC_1                         (0x8000)        /* ASQ control mode: The SDHS is controlled by the ASQ. - 
                                                            ASQ_ACQARM signal from the ASQ is the source of the 
                                                            SHDS_PWR_UP/DOWN signal - ASQ_ACQTRIG signal from the ASQ is 
                                                            the source of the CONVERSION_START/STOP signal */
#define TRGSRC_1_H                       (0x0080)
#define OBR                              (0x0c00)        /* Output Bit Resolution */
#define OBR_H                            (0x000c)
#define OBR0                             (0x0400)        /* Output Bit Resolution */
#define OBR0_H                           (0x0004)
#define OBR1                             (0x0800)        /* Output Bit Resolution */
#define OBR1_H                           (0x0008)
#define OBR_0                            (0x0000)        /* 12-bit */
#define OBR_1                            (0x0400)        /* 13-bit */
#define OBR_1_H                          (0x0004)
#define OBR_2                            (0x0800)        /* 14-bit */
#define OBR_2_H                          (0x0008)
#define OBR_3                            (0x0c00)        /* Reserved (default: 12-bit) */
#define OBR_3_H                          (0x000c)
#define SHIFT                            (0x3000)        /* MSB Shift */
#define SHIFT_H                          (0x0030)
#define SHIFT0                           (0x1000)        /* MSB Shift */
#define SHIFT0_H                         (0x0010)
#define SHIFT1                           (0x2000)        /* MSB Shift */
#define SHIFT1_H                         (0x0020)
#define SHIFT_0                          (0x0000)        /* No Shift, MSB. */
#define SHIFT_1                          (0x1000)        /* MSB - 1 (Shift left by 1 from filter out). If OBR = 2, then 
                                                            this configuration is invalid. No shift is performed. */
#define SHIFT_1_H                        (0x0010)
#define SHIFT_2                          (0x2000)        /* MSB -2 (Shift left by 2 from filter out). If OBR = 1, then 
                                                            this configuration is invalid. No shift is performed. */
#define SHIFT_2_H                        (0x0020)
#define SHIFT_3                          (0x3000)        /* Reserved (No shift) */
#define SHIFT_3_H                        (0x0030)

/* SDHSCTL1 Control Bits */
#define OSR                              (0x000f)        /* Over Sampling Rate. */
#define OSR_L                            (0x000f)
#define OSR0                             (0x0001)        /* Over Sampling Rate. */
#define OSR0_L                           (0x0001)
#define OSR1                             (0x0002)        /* Over Sampling Rate. */
#define OSR1_L                           (0x0002)
#define OSR2                             (0x0004)        /* Over Sampling Rate. */
#define OSR2_L                           (0x0004)
#define OSR3                             (0x0008)        /* Over Sampling Rate. */
#define OSR3_L                           (0x0008)
#define OSR_0                            (0x0000)        /* 10 */
#define OSR_1                            (0x0001)        /* 20 */
#define OSR_1_L                          (0x0001)
#define OSR_2                            (0x0002)        /* 40 */
#define OSR_2_L                          (0x0002)
#define OSR_3                            (0x0003)        /* 80 */
#define OSR_3_L                          (0x0003)
#define OSR_4                            (0x0004)        /* 160 */
#define OSR_4_L                          (0x0004)

/* SDHSCTL2 Control Bits */
#define SMPCTLOFF                        (0x0400)        /* Disable sampling size counting. */
#define SMPCTLOFF_H                      (0x0004)
#define SMPCTLOFF_0                      (0x0000)        /* Total sampling size is determined by SMPSZ bits. The SDHS 
                                                            automatically stops data conversion. */
#define SMPCTLOFF_1                      (0x0400)        /* SMPSZ bits are ignored. Conversion does not stop until the 
                                                            trigger source selected by TRGSRC bits is deasserted. */
#define SMPCTLOFF_1_H                    (0x0004)
#define SMPSZ                            (0x03ff)        /* Total Sample Size. */
#define SMPSZ_L                          (0x00ff)
#define SMPSZ_H                          (0x0003)
#define SMPSZ0                           (0x0001)        /* Total Sample Size. */
#define SMPSZ0_L                         (0x0001)
#define SMPSZ1                           (0x0002)        /* Total Sample Size. */
#define SMPSZ1_L                         (0x0002)
#define SMPSZ2                           (0x0004)        /* Total Sample Size. */
#define SMPSZ2_L                         (0x0004)
#define SMPSZ3                           (0x0008)        /* Total Sample Size. */
#define SMPSZ3_L                         (0x0008)
#define SMPSZ4                           (0x0010)        /* Total Sample Size. */
#define SMPSZ4_L                         (0x0010)
#define SMPSZ5                           (0x0020)        /* Total Sample Size. */
#define SMPSZ5_L                         (0x0020)
#define SMPSZ6                           (0x0040)        /* Total Sample Size. */
#define SMPSZ6_L                         (0x0040)
#define SMPSZ7                           (0x0080)        /* Total Sample Size. */
#define SMPSZ7_L                         (0x0080)
#define SMPSZ8                           (0x0100)        /* Total Sample Size. */
#define SMPSZ8_H                         (0x0001)
#define SMPSZ9                           (0x0200)        /* Total Sample Size. */
#define SMPSZ9_H                         (0x0002)
#define DTCOFF                           (0x8000)        /* Data Transfer Controller (DTC) Off */
#define DTCOFF_H                         (0x0080)
#define DTCOFF_0                         (0x0000)        /* DTC enabled. The DTC automatically transfers the data from the
                                                            SDHSDT register to the address specified in the DTCDA 
                                                            register. */
#define DTCOFF_1                         (0x8000)        /* DTC disabled. The data in the SDHSDT register must be read by 
                                                            CPU, otherwise the overflow interrupt flag (RIS.OVF) will 
                                                            eventually be asserted. */
#define DTCOFF_1_H                       (0x0080)
#define WINCMPEN                         (0x4000)        /* Window Comparator Enable */
#define WINCMPEN_H                       (0x0040)
#define WINCMPEN_0                       (0x0000)        /* Window Comparator is disabled */
#define WINCMPEN_1                       (0x4000)        /* Window Comparator is enabled */
#define WINCMPEN_1_H                     (0x0040)

