pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr50431.h
sfr_w(UUPSIIDX);                              /* Interrupt Index Register */
sfr_b(UUPSIIDX_L);
sfr_b(UUPSIIDX_H);
sfr_w(UUPSMIS);                               /* Masked Interrupt Status Register */
sfr_b(UUPSMIS_L);
sfr_b(UUPSMIS_H);
sfr_w(UUPSRIS);                               /* Raw Interrupt Status Register */
sfr_b(UUPSRIS_L);
sfr_b(UUPSRIS_H);
sfr_w(UUPSIMSC);                              /* Interrupt Mask Register */
sfr_b(UUPSIMSC_L);
sfr_b(UUPSIMSC_H);
sfr_w(UUPSICR);                               /* Interrupt Clear Register. */
sfr_b(UUPSICR_L);
sfr_b(UUPSICR_H);
sfr_w(UUPSISR);                               /* Interrupt Flag Set Register. */
sfr_b(UUPSISR_L);
sfr_b(UUPSISR_H);
sfr_w(UUPSDESCLO);                            /* UUPS Descriptor Register L. */
sfr_b(UUPSDESCLO_L);
sfr_b(UUPSDESCLO_H);
sfr_w(UUPSDESCHI);                            /* UUPS Descriptor Register H. */
sfr_b(UUPSDESCHI_L);
sfr_b(UUPSDESCHI_H);
sfr_w(UUPSCTL);                               /* UUPS Control */
sfr_b(UUPSCTL_L);
sfr_b(UUPSCTL_H);

/* UUPS Register Offsets */
#define OFS_UUPSIIDX                     (0x0000)
#define OFS_UUPSIIDX_L                   OFS_UUPSIIDX
#define OFS_UUPSIIDX_H                   OFS_UUPSIIDX+1
#define OFS_UUPSMIS                      (0x0002)
#define OFS_UUPSMIS_L                    OFS_UUPSMIS
#define OFS_UUPSMIS_H                    OFS_UUPSMIS+1
#define OFS_UUPSRIS                      (0x0004)
#define OFS_UUPSRIS_L                    OFS_UUPSRIS
#define OFS_UUPSRIS_H                    OFS_UUPSRIS+1
#define OFS_UUPSIMSC                     (0x0006)
#define OFS_UUPSIMSC_L                   OFS_UUPSIMSC
#define OFS_UUPSIMSC_H                   OFS_UUPSIMSC+1
#define OFS_UUPSICR                      (0x0008)
#define OFS_UUPSICR_L                    OFS_UUPSICR
#define OFS_UUPSICR_H                    OFS_UUPSICR+1
#define OFS_UUPSISR                      (0x000A)
#define OFS_UUPSISR_L                    OFS_UUPSISR
#define OFS_UUPSISR_H                    OFS_UUPSISR+1
#define OFS_UUPSDESCLO                   (0x000C)
#define OFS_UUPSDESCLO_L                 OFS_UUPSDESCLO
#define OFS_UUPSDESCLO_H                 OFS_UUPSDESCLO+1
#define OFS_UUPSDESCHI                   (0x000E)
#define OFS_UUPSDESCHI_L                 OFS_UUPSDESCHI
#define OFS_UUPSDESCHI_H                 OFS_UUPSDESCHI+1
#define OFS_UUPSCTL                      (0x0010)
#define OFS_UUPSCTL_L                    OFS_UUPSCTL
#define OFS_UUPSCTL_H                    OFS_UUPSCTL+1

/* UUPS Control Bits */

/* UUPSMIS Control Bits */
#define PTMOUT                           (0x0001)        /* UUPS Power Up Time Out Masked Interrupt Status bit. */
#define PTMOUT_L                         (0x0001)
#define PTMOUT_0                         (0x0000)        /* No interrupt pending */
#define PTMOUT_1                         (0x0001)        /* Interrupt pending */
#define PTMOUT_1_L                       (0x0001)
#define PREQIG                           (0x0002)        /* UUPS Power Request Ignore Masked Interrupt Status bit. */
#define PREQIG_L                         (0x0002)
#define PREQIG_0                         (0x0000)        /* No interrupt pending */
#define PREQIG_1                         (0x0002)        /* Interrupt pending */
#define PREQIG_1_L                       (0x0002)
#define STPBYDB                          (0x0004)        /* USS has been interrupted by debug mode Masked Interrupt Status
                                                            bit. */
#define STPBYDB_L                        (0x0004)
#define STPBYDB_0                        (0x0000)        /* No interrupt pending */
#define STPBYDB_1                        (0x0004)        /* Interrupt pending */
#define STPBYDB_1_L                      (0x0004)

/* UUPSCTL Control Bits */
#define USSPWRUP                         (0x0100)        /* Turn on USS Power and  PLL */
#define USSPWRUP_H                       (0x0001)
#define USSPWRUP_0                       (0x0000)        /* No action */
#define USSPWRUP_1                       (0x0100)        /* Power up the USS module and generate the PSQ_START to the ASQ 
                                                            if CTL.ASQEN = 1. Note: This bit becomes invalid in debug 
                                                            mode. */
#define USSPWRUP_1_H                     (0x0001)
#define ASQEN                            (0x0800)        /* Power Ready Output Event Select */
#define ASQEN_H                          (0x0008)
#define LDORDY                           (0x0001)        /* USS LDO is ready */
#define LDORDY_L                         (0x0001)
#define LDORDY_0                         (0x0000)        /* USS LDO is powered down or in transition mode */
#define LDORDY_1                         (0x0001)        /* USS LDO is powered on */
#define LDORDY_1_L                       (0x0001)
#define LBHDEL                           (0x3000)        /* Reserved_2 */
#define LBHDEL_H                         (0x0030)
#define LBHDEL0                          (0x1000)        /* Reserved_2 */
#define LBHDEL0_H                        (0x0010)
#define LBHDEL1                          (0x2000)        /* Reserved_2 */
#define LBHDEL1_H                        (0x0020)
#define LBHDEL_0                         (0x0000)        /* no additional delay */
#define LBHDEL_1                         (0x1000)        /* additional hold off delay of ~100us (512 REFCLKs) */
#define LBHDEL_1_H                       (0x0010)
#define LBHDEL_2                         (0x2000)        /* additional hold off delay of ~200us (1024 REFCLKs) */
#define LBHDEL_2_H                       (0x0020)
#define LBHDEL_3                         (0x3000)        /* additional hold off delay of ~300us (1536 REFCLKs) */
#define LBHDEL_3_H                       (0x0030)
#define USSPWRDN                         (0x4000)        /* USS Power Down */
#define USSPWRDN_H                       (0x0040)
#define USSPWRDN_0                       (0x0000)        /* No action */
#define USSPWRDN_1                       (0x4000)        /* Stop the current measurement and power off the USS module. */
#define USSPWRDN_1_H                     (0x0040)
#define USSPWRUPSEL                      (0x0600)        /* USS Power Up trigger source select. */
#define USSPWRUPSEL_H                    (0x0006)
#define USSPWRUPSEL0                     (0x0200)        /* USS Power Up trigger source select. */
#define USSPWRUPSEL0_H                   (0x0002)
#define USSPWRUPSEL1                     (0x0400)        /* USS Power Up trigger source select. */
#define USSPWRUPSEL1_H                   (0x0004)
#define USSPWRUPSEL_0                    (0x0000)        /* CTL.USSPWRUP bit */
#define USSPWRUPSEL_1                    (0x0200)        /* Ext. trigger (see the device specific datasheet) */
#define USSPWRUPSEL_1_H                  (0x0002)
#define USSPWRUPSEL_2                    (0x0400)        /* Ext. trigger (see the device-specific data sheet) */
#define USSPWRUPSEL_2_H                  (0x0004)
#define USSPWRUPSEL_3                    (0x0600)        /* Ext. trigger (see the device-specific data sheet) */
#define USSPWRUPSEL_3_H                  (0x0006)
#define USSSTOP                          (0x8000)        /* USS Measurement Stop */
#define USSSTOP_H                        (0x0080)
#define USSSTOP_0                        (0x0000)        /* No action */
#define USSSTOP_1                        (0x8000)        /* Stop the current measurement. */
#define USSSTOP_1_H                      (0x0080)
#define UPSTATE                          (0x0006)        /* USS Power Up trigger source select. */
#define UPSTATE_L                        (0x0006)
#define UPSTATE0                         (0x0002)        /* USS Power Up trigger source select. */
#define UPSTATE0_L                       (0x0002)
#define UPSTATE1                         (0x0004)        /* USS Power Up trigger source select. */
#define UPSTATE1_L                       (0x0004)
#define UPSTATE_0                        (0x0000)        /* USS is in OFF mode */
#define UPSTATE_1                        (0x0002)        /* USS is in STANDBY mode */
#define UPSTATE_1_L                      (0x0002)
#define UPSTATE_2                        (0x0004)        /* USS power mode is in transition. */
#define UPSTATE_2_L                      (0x0004)
#define UPSTATE_3                        (0x0006)        /* USS is in READY mode */
#define UPSTATE_3_L                      (0x0006)
#define USS_BUSY                         (0x0008)        /* USS Busy bit. */
#define USS_BUSY_L                       (0x0008)
#define USS_BUSY_0                       (0x0000)        /* The USS module is not busy. */
#define USS_BUSY_1                       (0x0008)        /* The USS module is busy. */
#define USS_BUSY_1_L                     (0x0008)
#define USSSWRST                         (0x0080)        /* */
#define USSSWRST_L                       (0x0080)
#define USSSWRST_0                       (0x0000)        /* Disabled. USS (and sub modules) reset released for operation */
#define USSSWRST_1                       (0x0080)        /* Enabled. USS (and sub modules) logic held in reset state */
#define USSSWRST_1_L                     (0x0080)


/*****************************************************************************
 WDT_A Registers
*****************************************************************************/

